## Terraform `Kubernetes`
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`
#### Plan Request Change 📖`success`
#### Apply 📖`failure`

<details><summary>Show Details</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = "catos66dnmadlbd2glcj"
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 01"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-01"
      + node_labels       = {
          + "environment" = "testing"
          + "role"        = "worker-01"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy (known after apply)

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = "catos66dnmadlbd2glcj"
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 02"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-02"
      + node_labels       = {
          + "environment" = "dev"
          + "role"        = "worker-02"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy {
          + max_expansion   = 1
          + max_unavailable = 1
        }

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 0
              + max     = 1
              + min     = 0
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

data.terraform_remote_state.vpc: Reading...
module.kube.random_string.unique_id: Refreshing state... [id=7f46kpjf]
module.kube.data.yandex_client_config.client: Reading...
module.kube.data.yandex_client_config.client: Read complete after 0s [id=3165309435]
module.kube.yandex_iam_service_account.master[0]: Refreshing state... [id=ajea8pbj4f601i56sm5u]
module.kube.yandex_iam_service_account.node_account[0]: Refreshing state... [id=aje7n2bce7r1d3hunl0p]
module.kube.yandex_kms_symmetric_key.kms_key[0]: Refreshing state... [id=abjes6v5635sq3hrssui]
data.terraform_remote_state.vpc: Read complete after 1s
module.kube.yandex_vpc_security_group.k8s_master_whitelist_sg[0]: Refreshing state... [id=enpmmfsa3fghjuaq0fi7]
module.kube.yandex_vpc_security_group.k8s_nodes: Refreshing state... [id=enp4nj9j4iin76n4t30v]
module.kube.yandex_vpc_security_group.k8s_main_sg[0]: Refreshing state... [id=enphhr50vgv3q3d6cu4t]
module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/logging.writer/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/load-balancer.admin/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/k8s.clusters.agent/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_resourcemanager_folder_iam_member.node_account[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/container-registry.images.puller/serviceAccount:aje7n2bce7r1d3hunl0p]
module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0]: Refreshing state... [id=abjes6v5635sq3hrssui/kms.keys.encrypterDecrypter]
module.kube.yandex_vpc_security_group_rule.k8s_node_ports[0]: Refreshing state... [id=enpv4rskkaipve0vl9de]
module.kube.yandex_vpc_security_group_rule.k8s_node_ssh_access_rule[0]: Refreshing state... [id=enpmt76mpaqqpnmjmd1v]
module.kube.yandex_vpc_security_group_rule.k8s_outgoing_traffic[0]: Refreshing state... [id=enpcbac0585q1cchaonk]
module.kube.time_sleep.wait_for_iam: Refreshing state... [id=2025-04-20T09:37:33Z]
module.kube.yandex_kubernetes_cluster.kube_cluster: Refreshing state... [id=catos66dnmadlbd2glcj]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = "catos66dnmadlbd2glcj"
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 01"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-01"
      + node_labels       = {
          + "environment" = "testing"
          + "role"        = "worker-01"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy (known after apply)

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = "catos66dnmadlbd2glcj"
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 02"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-02"
      + node_labels       = {
          + "environment" = "dev"
          + "role"        = "worker-02"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy {
          + max_expansion   = 1
          + max_unavailable = 1
        }

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 0
              + max     = 1
              + min     = 0
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Creating...
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Creating...


```

</details>

Results for commit: 316aaf498984e84317800880f42e67a26c121e8d

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `kube`, Workflow: `Terraform CI/CD`*